//Ќачальные установки ATmega162
#include "ioavr.h"

void StartSetup(void)
{

//Ќастройка портов
//все порты настроены на вход и наход€тс€ в Z-состо€нии

	DDRA=0xFF;    //
	PORTA=0x00;   //выход установлен в 0
	
	DDRB=0x70;    //
	PORTB=0x20;   //порт настроен на выход, PE.5 - установлен в 1
	
	DDRC=0x00;
	PORTC=0x00;   //PC.0-PC.3 выход 1, PC.4-PC.7 вход Z-состо€ние
	
	DDRD=0x00;
	PORTD=0x00;
	
	// таймер 2
	// делитель 1024
	// сброс/прерывание по совпадению
	TIMSK |= (1 << OCIE2);
	TCNT2 = 0;
	OCR2 = 10;
	TCCR2 = (1 << WGM21);
	TCCR2 |= (1 << CS22) | (1 << CS20);	
	
	TIMSK|=(1<<TOIE1);
	TCCR1A=0x00;
	TCCR1B=0x00;  //0x05 - делитель на 1024
	TCNT1H=0xF9;  //
	TCNT1L=0xE5;  //установка 0.1с при делителе 1024

}
